# CoordinateSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..CoordinateSystem Property
Connector Class See Also
---
The coordinate system of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Transform CoordinateSystem { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
```

Visual C++
---
```text
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
```

# ### Implements
IConnector..::..CoordinateSystem
# Remarks
The coordinate system's origin is the location of the connector and the Z-axis is normal to the connector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector is of logical type. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to get coordinate system. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace